[{"date": "5/24", "ranking": "1", "ideas": "Cloud computing can be vulnerable to malicious attacks and infrastructure failure. What are some ways to protect the cloud infrastructure from these vulnerabilities?"}, {"date": "6/10", "ranking": "2", "ideas": "I would like to see a lecture of on a good/secure way to address the common need of registering a user and letting then sign-on and then how to control what they can/cannot do"}, {"date": "6/10", "ranking": "3", "ideas": "I would like to see more \"finger exercises\" for the Rails part of the course. Rather than having a large single programming assignments have more smaller (and perhaps repetitious) exercises which help internalize the various parts of a SaaS/RoR application."}, {"date": "6/10", "ranking": "4", "ideas": "Including HTTP security heading and having a practical homework or two simulating a hacker (attacker) - doing a simple version of clickjacking or XSS ... something we can defend against later in another homework."}, {"date": "6/10", "ranking": "5", "ideas": "Would be great that students had the chance to create little projects (perhaps from a given list of suggested projects ?) done in small groups applying the techniques learnt throuhout the course and to get these projects evaluated by other students or the platform itself.  Perhaps this should be optional to the course because not all the students will love this idea because of the extra effort and time  required."}, {"date": "4/10", "ranking": "6", "ideas": "Cloud computing can be vulnerable to malicious attacks and infrastructure failure. What are some ways to protect the cloud infrastructure from these vulnerabilities?"}, {"date": "4/10", "ranking": "7", "ideas": "The lesson on SaaS architecture was hard to understand. It would be helpful to have more examples of the multi-tenant architecture. "}, {"date": "4/11", "ranking": "8", "ideas": "This MOOC should incorporate more opportunities for discussions."}, {"date": "6/10", "ranking": "9", "ideas": "It would be nice to include in addition to Rails something about lightweight frameworks such as Sinatra. Likewise, it would be nice to introduce a simple client MVC frameworks such as Backbone."}, {"date": "4/10", "ranking": "10", "ideas": "Licensing models (eg. Open Source vs. Proprietary, GPL vs. BSD) are a key part of SaaS. It would be great if we could discuss how legal issues about software can impact the engineering process."}]